#include <iostream>
#include <ctime>
using namespace std;
int main() {
	//вариант 1
	//1. Задан массив A, содержащий 10 целых случайных чисел от 0 до 20.Найти произведение элементов этого массива
	/*const int n = 10;
	int mas[n];
	srand(time(nullptr));
	long long p;
	for (int i = 0; i < n; i++) {
		mas[0] = 1;
		cout << mas[0] << ' ';
	}
	for (int i = 0; i < n; i++) {
		mas[i] = rand() % 61 - 30;
	}
	long long p = mas[i] * p;
	cout << p << endl;*/
	 //2 Задан массив, который содержит 8 случайных целых чисел от - 10 до 10. 
	//Найти сумму положительных элементов массива.
	/*const int n = 8;
	int mas[n];
	 int sum = 0;
	for (int i = 0; i < n; i++) {
		mas[i] = rand() % 31 - 10;
		cin >> mas[i];
	}
	for (int i = 0; i > n; i++) {
		cout << mas[i];
	}
	sum += mas[i];
	cout << sum << endl;*/
	//3 Задан массив, который содержит 16 случайных целых чисел от 0 до 20. 
	//Найти количество элементов массива, которые делятся на 3 и на 5.
	/*const int n = 16;
	int mas[n];
	int b;
	for (int i = 0; i < n; i++) {
		mas[i] = rand() % 51 - 20;
		cout << mas[0] << ' ';
	}
	for (int i = 0; i < n; i++) {
		b = (mas[i] % 3 == 0 || mas[i] % 5 == 0);
	}
	cout << b << endl;*/
	//4.Задан массив из 9 целых чисел  от - 10 до 10. Найти сумму элементов массива, которые являются 
	//четными числами.
	/*const int n = 9;
	int mas[n];
	int sum;
	for (int i = 0; i < n; i++) {
		mas[i] = rand() % 41 - 20;
		cout << mas[0] << ' ';
	}
	for (int i = 0; i < n; i++) {
		sum = mas[i] % 2 == 0;
	}
	cout << sum << endl;*/





	
	


	

	


	


}